RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_rtc.h
/*!
    \file    gd32h75e_rtc.h
    \brief   definitions for the RTC

    \version 2025-08-07, V1.2.0, firmware for GD32H75E
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32H75E_RTC_H
#define GD32H75E_RTC_H

#include "gd32h75e.h"

/* RTC definitions */
#define RTC                                RTC_BASE                                    /* RTC base address */

/* registers definitions */
#define RTC_TIME                           REG32((RTC) + 0x00000000U)                  /*!< RTC time of day register */
#define RTC_DATE                           REG32((RTC) + 0x00000004U)                  /*!< RTC date register */
#define RTC_CTL                            REG32((RTC) + 0x00000008U)                  /*!< RTC control register */
#define RTC_STAT                           REG32((RTC) + 0x0000000CU)                  /*!< RTC status register */
#define RTC_PSC                            REG32((RTC) + 0x00000010U)                  /*!< RTC time prescaler register */
#define RTC_WUT                            REG32((RTC) + 0x00000014U)                  /*!< RTC wakeup timer regiser */
#define RTC_ALRM0TD                        REG32((RTC) + 0x0000001CU)                  /*!< RTC alarm 0 time and date register */
#define RTC_ALRM1TD                        REG32((RTC) + 0x00000020U)                  /*!< RTC alarm 1 time and date register */
#define RTC_WPK                            REG32((RTC) + 0x00000024U)                  /*!< RTC write protection key register */
#define RTC_SS                             REG32((RTC) + 0x00000028U)                  /*!< RTC sub second register */
#define RTC_SHIFTCTL                       REG32((RTC) + 0x0000002CU)                  /*!< RTC shift function control register */
#define RTC_TTS                            REG32((RTC) + 0x00000030U)                  /*!< RTC time of timestamp register */
#define RTC_DTS                            REG32((RTC) + 0x00000034U)                  /*!< RTC date of timestamp register */
#define RTC_SSTS                           REG32((RTC) + 0x00000038U)                  /*!< RTC sub second of timestamp register */
#define RTC_HRFC                           REG32((RTC) + 0x0000003CU)                  /*!< RTC high resolution frequency compensation register */
#define RTC_TAMP                           REG32((RTC) + 0x00000040U)                  /*!< RTC tamper register */
#define RTC_ALRM0SS                        REG32((RTC) + 0x00000044U)                  /*!< RTC alarm 0 sub second register */
#define RTC_ALRM1SS                        REG32((RTC) + 0x00000048U)                  /*!< RTC alarm 1 sub second register */
#define RTC_CFG                            REG32((RTC) + 0x0000004CU)                  /*!< RTC configure register */
#define RTC_BKP0                           REG32((RTC) + 0x00000050U)                  /*!< RTC backup 0 register */
#define RTC_BKP1                           REG32((RTC) + 0x00000054U)                  /*!< RTC backup 1 register */
#define RTC_BKP2                           REG32((RTC) + 0x00000058U)                  /*!< RTC backup 2 register */
#define RTC_BKP3                           REG32((RTC) + 0x0000005CU)                  /*!< RTC backup 3 register */
#define RTC_BKP4                           REG32((RTC) + 0x00000060U)                  /*!< RTC backup 4 register */
#define RTC_BKP5                           REG32((RTC) + 0x00000064U)                  /*!< RTC backup 5 register */
#define RTC_BKP6                           REG32((RTC) + 0x00000068U)                  /*!< RTC backup 6 register */
#define RTC_BKP7                           REG32((RTC) + 0x0000006CU)                  /*!< RTC backup 7 register */
#define RTC_BKP8                           REG32((RTC) + 0x00000070U)                  /*!< RTC backup 8 register */
#define RTC_BKP9                           REG32((RTC) + 0x00000074U)                  /*!< RTC backup 9 register */
#define RTC_BKP10                          REG32((RTC) + 0x00000078U)                  /*!< RTC backup 10 register */
#define RTC_BKP11                          REG32((RTC) + 0x0000007CU)                  /*!< RTC backup 11 register */
#define RTC_BKP12                          REG32((RTC) + 0x00000080U)                  /*!< RTC backup 12 register */
#define RTC_BKP13                          REG32((RTC) + 0x00000084U)                  /*!< RTC backup 13 register */
#define RTC_BKP14                          REG32((RTC) + 0x00000088U)                  /*!< RTC backup 14 register */
#define RTC_BKP15                          REG32((RTC) + 0x0000008CU)                  /*!< RTC backup 15 register */
#define RTC_BKP16                          REG32((RTC) + 0x00000090U)                  /*!< RTC backup 16 register */
#define RTC_BKP17                          REG32((RTC) + 0x00000094U)                  /*!< RTC backup 17 register */
#define RTC_BKP18                          REG32((RTC) + 0x00000098U)                  /*!< RTC backup 18 register */
#define RTC_BKP19                          REG32((RTC) + 0x0000009CU)                  /*!< RTC backup 19 register */
#define RTC_BKP20                          REG32((RTC) + 0x000000A0U)                  /*!< RTC backup 20 register */
#define RTC_BKP21                          REG32((RTC) + 0x000000A4U)                  /*!< RTC backup 21 register */
#define RTC_BKP22                          REG32((RTC) + 0x000000A8U)                  /*!< RTC backup 22 register */
#define RTC_BKP23                          REG32((RTC) + 0x000000ACU)                  /*!< RTC backup 23 register */
#define RTC_BKP24                          REG32((RTC) + 0x000000B0U)                  /*!< RTC backup 24 register */
#define RTC_BKP25                          REG32((RTC) + 0x000000B4U)                  /*!< RTC backup 25 register */
#define RTC_BKP26                          REG32((RTC) + 0x000000B8U)                  /*!< RTC backup 26 register */
#define RTC_BKP27                          REG32((RTC) + 0x000000BCU)                  /*!< RTC backup 27 register */
#define RTC_BKP28                          REG32((RTC) + 0x000000C0U)                  /*!< RTC backup 28 register */
#define RTC_BKP29                          REG32((RTC) + 0x000000C4U)                  /*!< RTC backup 29 register */
#define RTC_BKP30                          REG32((RTC) + 0x000000C8U)                  /*!< RTC backup 30 register */
#define RTC_BKP31                          REG32((RTC) + 0x000000CCU)                  /*!< RTC backup 31 register */

