RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_rtc.h
/* RTC_SHIFTCTL */
#define RTC_SHIFTCTL_SFS                   BITS(0,14)                                  /*!< subtract a fraction of a second */
#define RTC_SHIFTCTL_A1S                   BIT(31)                                     /*!< one second add */

/* RTC_TTS */
#define RTC_TTS_SCU                        BITS(0,3)                                   /*!< second units in BCD code */
#define RTC_TTS_SCT                        BITS(4,6)                                   /*!< second tens in BCD code */
#define RTC_TTS_MNU                        BITS(8,11)                                  /*!< minute units in BCD code */
#define RTC_TTS_MNT                        BITS(12,14)                                 /*!< minute tens in BCD code */
#define RTC_TTS_HRU                        BITS(16,19)                                 /*!< hour units in BCD code */
#define RTC_TTS_HRT                        BITS(20,21)                                 /*!< hour tens in BCD code */
#define RTC_TTS_PM                         BIT(22)                                     /*!< AM/PM notation */

/* RTC_DTS */
#define RTC_DTS_DAYU                       BITS(0,3)                                   /*!< date units in BCD code */
#define RTC_DTS_DAYT                       BITS(4,5)                                   /*!< date tens in BCD code */
#define RTC_DTS_MONU                       BITS(8,11)                                  /*!< month units in BCD code */
#define RTC_DTS_MONT                       BIT(12)                                     /*!< month tens in BCD code */
#define RTC_DTS_DOW                        BITS(13,15)                                 /*!< day of week units */

/* RTC_SSTS */
#define RTC_SSTS_SSC                       BITS(0,15)                                  /*!< timestamp sub second units */

/* RTC_HRFC */
#define RTC_HRFC_CMSK                      BITS(0,8)                                   /*!< calibration mask number */
#define RTC_HRFC_CWND16                    BIT(13)                                     /*!< calibration window select 16 seconds */
#define RTC_HRFC_CWND8                     BIT(14)                                     /*!< calibration window select 8 seconds */
#define RTC_HRFC_FREQI                     BIT(15)                                     /*!< increase RTC frequency by 488.5ppm */

/* RTC_TAMP */
#define RTC_TAMP_TP0EN                     BIT(0)                                      /*!< tamper 0 detection enable */
#define RTC_TAMP_TP0EG                     BIT(1)                                      /*!< tamper 0 event trigger edge for RTC tamp 0 input */
#define RTC_TAMP_TPIE                      BIT(2)                                      /*!< enable tamper interrupt */
#define RTC_TAMP_TP1EN                     BIT(5)                                      /*!< tamper 1 detection enable */
#define RTC_TAMP_TP1EG                     BIT(6)                                      /*!< tamper 1 event trigger edge for RTC tamp 1 input */
#define RTC_TAMP_TPTS                      BIT(7)                                      /*!< make tamper function used for timestamp function */
#define RTC_TAMP_FREQ                      BITS(8,10)                                  /*!< sample frequency of tamper event detection */
#define RTC_TAMP_FLT                       BITS(11,12)                                 /*!< RTC tamp x filter count setting */
#define RTC_TAMP_PRCH                      BITS(13,14)                                 /*!< precharge duration time of RTC tamp x */
#define RTC_TAMP_DISPU                     BIT(15)                                     /*!< RTC tamp x pull up disable bit */

/* RTC_ALRM0SS */
#define RTC_ALRM0SS_SSC                    BITS(0,14)                                  /*!< alarm0 sub second value */
#define RTC_ALRM0SS_MASKSSC                BITS(24,27)                                 /*!< mask control bit of SS */

/* RTC_ALRM1SS */
#define RTC_ALRM1SS_SSC                    BITS(0,14)                                  /*!< alarm1 sub second value */
#define RTC_ALRM1SS_MASKSSC                BITS(24,27)                                 /*!< mask control bit of SS */

/* RTC_CFG */
#define RTC_CFG_OUT2EN                     BIT(1)                                      /*!< RTC_OUT is output on PB2 or PC13 */
#define RTC_CFG_ALRMOUTTYPE                BIT(0)                                      /*!< RTC_ALARM output is Push-pull output type */ 

/* RTC_BKP0 */
#define RTC_BKP0_DATA                      BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP1 */
#define RTC_BKP1_DATA                      BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP2 */
#define RTC_BKP2_DATA                      BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP3 */
#define RTC_BKP3_DATA                      BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP4 */
#define RTC_BKP4_DATA                      BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP5 */
#define RTC_BKP5_DATA                      BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP6 */
#define RTC_BKP6_DATA                      BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP7 */
#define RTC_BKP7_DATA                      BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP8 */
#define RTC_BKP8_DATA                      BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP9 */
#define RTC_BKP9_DATA                      BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP10 */
#define RTC_BKP10_DATA                     BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP11 */
#define RTC_BKP11_DATA                     BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP12 */
#define RTC_BKP12_DATA                     BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP13 */
#define RTC_BKP13_DATA                     BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP14 */
#define RTC_BKP14_DATA                     BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP15 */
#define RTC_BKP15_DATA                     BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP16 */
#define RTC_BKP16_DATA                     BITS(0,31)                                  /*!< backup domain registers */

