RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_rtc.h
/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
#define NOT_RTC_ALARM_VALID(rtc_alarm)        (((rtc_alarm) != RTC_ALARM0) && ((rtc_alarm) != RTC_ALARM1))                  

#define NOT_RTC_ALARM_MASK(mask)              (((mask) != RTC_ALARM_NONE_MASK) && ((mask) != RTC_ALARM_DATE_MASK) && \
                                              ((mask) != RTC_ALARM_HOUR_MASK) && ((mask) != RTC_ALARM_MINUTE_MASK) && \
                                              ((mask) != RTC_ALARM_SECOND_MASK) && ((mask) != RTC_ALARM_ALL_MASK))

#define NOT_RTC_WEEKDAY_OR_DATE(weekday)      (((weekday) != RTC_ALARM_DATE_SELECTED) && ((weekday) != RTC_ALARM_WEEKDAY_SELECTED))

#define NOT_RTC_ALARM_DAY(day)                (((day) != RTC_MONDAY) && ((day) != RTC_TUESDAY) && \
                                              ((day) != RTC_WEDNESDAY) && ((day) != RTC_THURSDAY) && \
                                              ((day) != RTC_FRIDAY) && ((day) != RTC_SATURDAY) && \
                                              ((day) != RTC_SUNDAY) && (((day) > 0x31U) || ((day) == 0x00U)))

#define NOT_RTC_ALARM_HOUR(hour)              ((hour) > 0x23U)
#define NOT_RTC_ALARM_MINUTE(minute)          ((minute) > 0x59U)
#define NOT_RTC_ALARM_SECOND(second)          ((second) > 0x59U)
#define NOT_RTC_AM_PM(ampm)                   (((ampm) != RTC_AM) && ((ampm) != RTC_PM))
#define NOT_RTC_YEAR(year)                    ((year) > 0x99U)
#define NOT_RTC_MONTH(mouth)                  (((mouth) != RTC_JAN) && ((mouth) != RTC_FEB) && \
                                              ((mouth) != RTC_MAR) && ((mouth) != RTC_APR) && \
                                              ((mouth) != RTC_MAY) && ((mouth) != RTC_JUN) && \
                                              ((mouth) != RTC_JUL) && ((mouth) != RTC_AUG) && \
                                              ((mouth) != RTC_SEP) && ((mouth) != RTC_OCT) && \
                                              ((mouth) != RTC_NOV) && ((mouth) != RTC_DEC))
																							
#define NOT_RTC_DATE(date)                    (((date) > 0x31U) || ((date) == 0x00U))

#define NOT_RTC_EDGE(edge)                    (((edge) != RTC_TIMESTAMP_RISING_EDGE) && ((edge) != RTC_TIMESTAMP_FALLING_EDGE))

#define NOT_RTC_ITSEN_MODE_VALID(mode)        (((mode) != RTC_ITSEN_DISABLE )&& ((mode) != RTC_ITSEN_ENABLE))

#define NOT_RTC_TAMPER_SOURCE(source)         (((source) != RTC_TAMPER0) && ((source) != RTC_TAMPER1))

#define NOT_RTC_TAMPER_TRIGGER_VALID(trigger) (((trigger) != RTC_TAMPER_TRIGGER_EDGE_RISING) && ((trigger) != RTC_TAMPER_TRIGGER_EDGE_FALLING )&& \
					      ((trigger) != RTC_TAMPER_TRIGGER_LEVEL_LOW) && ((trigger) != RTC_TAMPER_TRIGGER_LEVEL_HIGH))
																							
#define NOT_RTC_TAMPER_FILTER_VALID(filter)   (((filter) != RTC_FLT_EDGE) &&((filter) != RTC_FLT_2S)&& \
                                              ((filter) != RTC_FLT_4S) &&((filter) != RTC_FLT_8S))
																							
#define NOT_RTC_SAMPLE_FREQ_VALID(freq)       (((freq) != RTC_FREQ_DIV32768 )&& ((freq) != RTC_FREQ_DIV16384) && \
                                              ((freq) != RTC_FREQ_DIV8192 )&& ((freq) != RTC_FREQ_DIV4096) && \
		                              ((freq) != RTC_FREQ_DIV2048) && ((freq) != RTC_FREQ_DIV1024)&& \
					      ((freq) != RTC_FREQ_DIV512) &&  ((freq) != RTC_FREQ_DIV256))
 
#define NOT_RTC_ALARM_OUTPUT_MODE_VALID(mode) (((mode) != RTC_ALARM_OUTPUT_OD) && ((mode) != RTC_ALARM_OUTPUT_PP))

#define NOT_RTC_TAMPER_PRECHARGE_TIME(time)   (((time) !=  RTC_PRCH_1C )&& ((time) &&  RTC_PRCH_2C) && \
                                              ((time) !=  RTC_PRCH_4C) && ((time) !=  RTC_PRCH_8C))
 
#define NOT_RTC_ALARM_OUTPUT_SOURCE_VALID(source) (((source) != RTC_ALARM0_HIGH) && ((source) != RTC_ALARM0_LOW) && \
                                                  ((source)  !=  RTC_ALARM1_HIGH)&&((source)  !=  RTC_ALARM1_LOW) && \
						  ((source)  !=  RTC_WAKEUP_HIGH)&&((source)  !=  RTC_WAKEUP_LOW))
																									
#define NOT_RTC_WAKEUP_CLOCK_VALID(wakeup_clock)  (((wakeup_clock) != WAKEUP_RTCCK_DIV16) &&((wakeup_clock) != WAKEUP_RTCCK_DIV8) && \
                                                  ((wakeup_clock) != WAKEUP_RTCCK_DIV4)&&((wakeup_clock) != WAKEUP_RTCCK_DIV2) && \
						                                      ((wakeup_clock) != WAKEUP_CKSPRE)&& ((wakeup_clock) != WAKEUP_CKSPRE_2EXP16))

#define NOT_RTC_WAKEUP_TIMER_VALID(wakeup_timer)  ((wakeup_timer) == 0x0000U)

#define NOT_RTC_SOURCE(source)                (((source) != RTC_CALIBRATION_512HZ) && ((source) != RTC_CALIBRATION_1HZ))

#define NOT_RTC_MODE(mode)                    (((mode) != RTC_ALARM_OUTPUT_OD) && ((mode) !=  RTC_CTL_ALRMOUTTYPE))

#define NOT_RTC_MASK_SUBSECOND(mask)          (((mask) != RTC_MSKSSC_0_14) && ((mask) != RTC_MSKSSC_1_14) && \
                                              ((mask) != RTC_MSKSSC_2_14) && ((mask) != RTC_MSKSSC_3_14) && \
                                              ((mask) != RTC_MSKSSC_4_14) && ((mask) != RTC_MSKSSC_5_14) && \
                                              ((mask) != RTC_MSKSSC_6_14) && ((mask) != RTC_MSKSSC_7_14) && \
                                              ((mask) != RTC_MSKSSC_8_14) && ((mask) != RTC_MSKSSC_9_14) && \
                                              ((mask) != RTC_MSKSSC_10_14) && ((mask) != RTC_MSKSSC_11_14) && \
                                              ((mask) != RTC_MSKSSC_12_14) && ((mask) != RTC_MSKSSC_13_14) && \
                                              ((mask) != RTC_MSKSSC_14) && ((mask) != RTC_MSKSSC_NONE))
																							
#define NOT_RTC_SUBSECOND(subsecond)          ((subsecond) > 0x7FFFU)

#define NOT_RTC_DAY_OF_WEEK(week)             (((week) != RTC_MONDAY) && ((week) != RTC_TUESDAY) && \
                                              ((week) != RTC_WEDNESDAY) && ((week) != RTC_THURSDAY) && \
                                              ((week) != RTC_FRIDAY) && ((week) != RTC_SATURDAY) && \
                                              ((week) != RTC_SUNDAY))

#define NOT_RTC_HOUR(hour)                    ((hour) > 0x23U)
#define NOT_RTC_MINUTE(minute)                ((minute) > 0x59U)
#define NOT_RTC_SECOND(second)                ((second) > 0x59U) 
#define NOT_RTC_FACTOR_ASYN(asyn)             ((asyn) > 0x7FU) 
#define NOT_RTC_FACTOR_SYN(syn)               ((syn) > 0x7FFFU)
#define NOT_RTC_DISPLAY_FORMAT(format)        (((format) != RTC_24HOUR) && ((format) != RTC_12HOUR))

#define NOT_RTC_OPERATION(operation)          (((operation) != RTC_CTL_A1H) && ((operation) != RTC_CTL_S1H))
#define NOT_RTC_ADD(add)                      (((add) != RTC_SHIFT_ADD1S_RESET) && ((add) != RTC_SHIFT_ADD1S_SET))
#define NOT_RTC_MINUS(minus)                  ((minus) > 0x7FFFU)
#define NOT_RTC_WINDOW(window)                (((window) != RTC_CALIBRATION_WINDOW_32S) && ((window) != RTC_CALIBRATION_WINDOW_16S) && \
                                              ((window) != RTC_CALIBRATION_WINDOW_8S))
#define NOT_RTC_PLUS(plus)                    (((plus) != RTC_CALIBRATION_PLUS_SET) && ((plus) != RTC_CALIBRATION_PLUS_RESET))
#define NOT_RTC_SMOOTH_MINUS(smooth_minus)    ((smooth_minus) > 0x1FFU)

